Documents/Иск.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>Иск</Name>
			<BasedOn>
				<xr:Item>Document.Претензия</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСудебнойИнстанции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОформления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПретензии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПринятия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрацииОрганизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРешенияГорсовета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобрания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗатратыИТО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальнаяСуммаДолга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРешенияГорсовета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебнаяИнстанция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДолга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Иск/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// Работа с макетами офисных документов.

Функция ПолучитьДанныеПечати(знач МассивДокументов, знач МассивИменМакетов) Экспорт
	
	ДанныеПоВсемОбъектам = Новый Соответствие;
	
	Для Каждого ОбъектСсылка Из МассивДокументов Цикл
		ДанныеОбъектаПоМакетам = Новый Соответствие;
		Для Каждого ИмяМакета Из МассивИменМакетов Цикл
			ДанныеОбъектаПоМакетам.Вставить(ИмяМакета, ПолучитьДанныеОбъекта(ОбъектСсылка));
		КонецЦикла;
		ДанныеПоВсемОбъектам.Вставить(ОбъектСсылка, ДанныеОбъектаПоМакетам);
	КонецЦикла;
	
	ОписаниеОбластей = Новый Соответствие;
	ДвоичныеДанныеМакетов = Новый Соответствие;
	ТипыМакетов = Новый Соответствие;
	
	Для Каждого ИмяМакета Из МассивИменМакетов Цикл
		Если ИмяМакета = "Иск(MSWord)" Тогда
			ДвоичныеДанныеМакетов.Вставить(ИмяМакета, 
											УправлениеПечатью.ПолучитьМакет("Документ.Иск.ПФ_DOC_Иск"));
			ТипыМакетов.Вставить(ИмяМакета, "DOC");
		ИначеЕсли ИмяМакета = "Иск(ODT)" Тогда
			ДвоичныеДанныеМакетов.Вставить(ИмяМакета, УправлениеПечатью.ПолучитьМакет("Документ.Иск.ПФ_DOC_Иск"));
			ТипыМакетов.Вставить(ИмяМакета, "ODT");
		КонецЕсли;
		ОписаниеОбластей.Вставить(ИмяМакета, ПолучитьОписаниеОбластейМакетаОфисногоДокумента());
	КонецЦикла;
	
	Возврат Новый Структура("Данные, Макеты",
							ДанныеПоВсемОбъектам,
							Новый Структура("ОписаниеОбластей, ТипыМакетов, ДвоичныеДанныеМакетов",
											ОписаниеОбластей,
											ТипыМакетов,
											ДвоичныеДанныеМакетов));
	
КонецФункции

Функция ПолучитьДанныеОбъекта(СсылкаНаОбъект)
	
	Объект = СсылкаНаОбъект.ПолучитьОбъект();
	
	Если Объект.Здание.КонтактнаяИнформация.Количество() > 0 Тогда
		Для каждого СтрокаАдреса Из Объект.Здание.КонтактнаяИнформация Цикл
			Если СтрокаАдреса.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресЗданияИСооружения Тогда
				Адрес = СтрокаАдреса.ЗначенияПолей;
			КонецЕсли;
		КонецЦикла; 
	Иначе
		Адрес = "";
	КонецЕсли;
		
	Если Объект.Организация.КонтактнаяИнформация.Количество() > 0 Тогда
		Для каждого СтрокаАдреса Из Объект.Организация.КонтактнаяИнформация Цикл
			Если СтрокаАдреса.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации Тогда
				АдресОрганизации = СтрокаАдреса.ЗначенияПолей;
			ИначеЕсли СтрокаАдреса.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации Тогда
				ТелефонОрганизации = СтрокаАдреса.Представление;
			КонецЕсли;
		КонецЦикла; 
	Иначе
		АдресОрганизации = "";
		ТелефонОрганизации = "";
	КонецЕсли;
				
	СтруктураАдреса = НайтиРеквизитыАдреса(Адрес);
	
	Попытка
		АдресКратко = "м. " + СтруктураАдреса.Город + ", вул. " + СтруктураАдреса.Улица + ", буд. №" + СтруктураАдреса.Дом;
	Исключение
		Сообщить(НСтр("ru='Не удалось получить адрес здания. Проверьте правильность заполнения адреса.';uk='Не вдалося отримати адресу будівлі. Перевірте правильність заповнення адреси.'"));
	КонецПопытки;
	
	СтруктураАдреса = НайтиРеквизитыАдреса(АдресОрганизации);
	
	Попытка
		АдресОрганизацииКратко = "м. " + СтруктураАдреса.Город + ", вул. " + СтруктураАдреса.Улица + ", буд. №" + СтруктураАдреса.Дом;
	Исключение
		Сообщить(НСтр("ru='Не удалось получить адрес организации. Проверьте правильность заполнения адреса.';uk='Не вдалося отримати адресу організації. Перевірте правильність заповнення адреси.'"));
	КонецПопытки;
	
	ДанныеОбъекта = Новый Структура;
	НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Объект.Номер, Истина, Истина);
	
	ДанныеОбъекта.Вставить("НомерДокумента",	НомерДокумента);
	ДанныеОбъекта.Вставить("ДатаДокумента",		Формат(Объект.Дата,"ДФ=dd.MM.yyyy"));
	ДанныеОбъекта.Вставить("КодЕГРПОУ",			Объект.Организация.КодПоЕДРПОУ);
	ДанныеОбъекта.Вставить("ОрганизацияАдрес",	АдресОрганизацииКратко);
	ДанныеОбъекта.Вставить("ОрганизацияТел",	ТелефонОрганизации);
	ДанныеОбъекта.Вставить("Должник",			Объект.Должник);
	ДанныеОбъекта.Вставить("СуммаИска",			Объект.СуммаДолга + Объект.ЗатратыИТО + Объект.СуммаДолга*0.01);
	ДанныеОбъекта.Вставить("СуммаДолга",		Объект.СуммаДолга);
	ДанныеОбъекта.Вставить("Организация",		Объект.Организация.НаименованиеПолное);
	ДанныеОбъекта.Вставить("Адрес",				АдресКратко);
	ДанныеОбъекта.Вставить("Директор",			Объект.Организация.ТекущийРуководитель);
	ДанныеОбъекта.Вставить("ДатаПередачи",		Формат(Объект.Здание.ДатаПринятияНаБаланс,"ДФ=dd.MM.yyyy"));
	ДанныеОбъекта.Вставить("НачалоПериода",		Формат(Объект.НачалоПериода,"ДФ=dd.MM.yyyy"));
	ДанныеОбъекта.Вставить("КонецПериода",		Формат(Объект.КонецПериода,"ДФ=dd.MM.yyyy"));
	ДанныеОбъекта.Вставить("ДатаСобрания",		Формат(Объект.ДатаСобрания,"ДФ=dd.MM.yyyy"));
	ДанныеОбъекта.Вставить("Квартира",			Объект.ЛицевойСчет.ОбъектЛицевогоСчета);
	ДанныеОбъекта.Вставить("НазваниеСуда",		Объект.СудебнаяИнстанция);
	ДанныеОбъекта.Вставить("АдресСуда",			Объект.АдресСудебнойИнстанции);
	ДанныеОбъекта.Вставить("ДатаРегистрации",	Формат(Объект.ДатаРегистрацииОрганизации,"ДФ=dd.MM.yyyy"));
	ДанныеОбъекта.Вставить("ДатаПринятия",		Формат(Объект.ДатаПринятия,"ДФ=dd.MM.yyyy"));
	ДанныеОбъекта.Вставить("ДатаОформления",	Формат(Объект.ДатаОформления,"ДФ=dd.MM.yyyy"));
	ДанныеОбъекта.Вставить("ДатаПретензии",		Формат(Объект.ДатаПретензии,"ДФ=dd.MM.yyyy"));
	ДанныеОбъекта.Вставить("ДатаРешения",		Формат(Объект.ДатаРешенияГорсовета,"ДФ=dd.MM.yyyy"));
    ДанныеОбъекта.Вставить("НомерРешения",		Объект.НомерРешенияГорсовета);
    ДанныеОбъекта.Вставить("ДолгНачальный",		Объект.НачальнаяСуммаДолга);
    ДанныеОбъекта.Вставить("Квартплата",		Объект.Квартплата);
	ДанныеОбъекта.Вставить("НомерРешения",		Объект.НомерРешенияГорсовета);
	ДанныеОбъекта.Вставить("ЗатратыИТЗ",		Объект.ЗатратыИТО);
	ДанныеОбъекта.Вставить("СудебныеИздержки",	Объект.ЗатратыИТО + Объект.СуммаДолга*0.01);
	ДанныеОбъекта.Вставить("СудебныйСбор",		(Объект.СуммаДолга*0.01));
	ДанныеОбъекта.Вставить("ИНН",				Объект.Организация.ИНН);
	ДанныеОбъекта.Вставить("НомерСвидетельства",Объект.Организация.НомерСвидетельства);
	ДанныеОбъекта.Вставить("ОрганизацияПолное",	Объект.Организация.НаименованиеПолное);
	
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Функция ПолучитьОписаниеОбластейМакетаОфисногоДокумента()
	
	ОписаниеОбластей = Новый Структура;
	
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ВерхнийКолонтитул",	"ВерхнийКолонтитул");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "НижнийКолонтитул",		"НижнийКолонтитул");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Заголовок",			"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Тело",					"Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Подвал",				"Общая");

	
	Возврат ОписаниеОбластей;
	
КонецФункции

Функция НайтиРеквизитыАдреса(Адрес)
	
	СтруктураАдреса = Новый Структура;
	КлючПоследнегоЭлемента = Неопределено;
	
	Для Сч = 1 По СтрЧислоСтрок(Адрес) Цикл
		Стр = СтрПолучитьСтроку(Адрес, Сч);
		Если Лев(Стр, 1) = Символы.Таб Тогда
			Если КлючПоследнегоЭлемента <> Неопределено Тогда
				СтруктураАдреса.Вставить(
				КлючПоследнегоЭлемента,
				СтруктураАдреса[КлючПоследнегоЭлемента] + Символы.ПС + Сред(Стр, 2)
				);
			КонецЕсли;
		Иначе
			Поз = Найти(Стр, "=");
			Если Поз <> 0 Тогда
				КлючПоследнегоЭлемента = Лев(Стр, Поз-1);
				СтруктураАдреса.Вставить(КлючПоследнегоЭлемента, СокрЛП(Сред(Стр, Поз+1)));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураАдреса;
	
КонецФункции // ()
